let str ='[00:02.18]公子向北走\n' +
    '[00:04.35]词：佚名\n' +
    '[00:05.92]改编：李亮节\n' +
    '[00:07.83]曲：李亮节\n' +
    '[00:09.78]音乐制作人：刘骏\n' +
    '[00:11.75]演唱：李春花\n' +
    '[00:13.65]录音室：天津盛音虔栈文化工作室\n' +
    '[00:15.58]发行公司：杭州回声文化艺术策划有限公司\n' +
    '[00:17.58]\n' +
    '[00:19.49]小女子不才\n' +
    '[00:23.29]未得公子青睐\n' +
    '[00:27.18]扰公子良久\n' +
    '[00:30.97]公子勿怪\n' +
    '[00:34.91]公子向北走\n' +
    '[00:38.74]小女子向南瞧\n' +
    '[00:42.70]此生就此别过了\n' +
    '[00:46.59]难以忘怀\n' +
    '[00:54.26]愿你三冬暖\n' +
    '[00:58.09]愿你春不寒\n' +
    '[01:01.98]愿你天黑有灯\n' +
    '[01:05.81]下雨有伞\n' +
    '[01:09.71]愿你善其身\n' +
    '[01:13.60]愿你遇良人\n' +
    '[01:17.53]暖色浮余生\n' +
    '[01:21.58]有好人相伴\n' +
    '[01:25.47]\n' +
    '[01:56.23]所有爱慕之意\n' +
    '[02:00.08]止于唇齿间\n' +
    '[02:04.06]掩于岁月\n' +
    '[02:07.96]匿于将来\n' +
    '[02:11.85]与君今生无缘\n' +
    '[02:15.57]请无需挂念\n' +
    '[02:19.45]雨打芭蕉\n' +
    '[02:23.32]无可无奈\n' +
    '[02:31.08]愿你三冬暖\n' +
    '[02:34.88]愿你春不寒\n' +
    '[02:38.80]愿你天黑有灯\n' +
    '[02:42.65]下雨有伞\n' +
    '[02:46.58]愿你善其身\n' +
    '[02:50.46]愿你遇良人\n' +
    '[02:54.31]暖色浮余生\n' +
    '[02:57.63]有好人相伴\n' +
    '[03:02.16]愿你三冬暖\n' +
    '[03:05.92]愿你春不寒\n' +
    '[03:09.77]愿你天黑有灯\n' +
    '[03:13.58]下雨有伞\n' +
    '[03:17.48]愿你善其身\n' +
    '[03:21.31]愿你遇良人\n' +
    '[03:25.22]暖色浮余生\n' +
    '[03:28.53]有好人相伴\n' +
    '[03:35.05]小女子不才\n' +
    '[03:38.73]未得公子青睐\n' +
    '[03:42.69]扰公子良久\n' +
    '[03:46.59]公子\n' +
    '[03:50.16]勿怪\n' +
    '[03:51.72]\n' +
    '[03:54.01]';
let data = {
    name:'李春花',
    song:'公子向北走'
};

